================================================================================
Module
================================================================================
module Foo;
--------------------------------------------------------------------------------

(module
  (module_decl
    (ident)))

================================================================================
Import
================================================================================
import Foo;
--------------------------------------------------------------------------------

(module
  (import
    (ident)))

================================================================================
Set add
================================================================================

add s1[12];
add s2[s3];

--------------------------------------------------------------------------------

(module
  (statement
    (expression
      (set_add
        (ident)
        (expression
          (integer)))))
  (statement
    (expression
      (set_add
        (ident)
        (expression
          (ident))))))

================================================================================
Local variable
================================================================================

{
local f2 = "-";
}

--------------------------------------------------------------------------------

(module
  (statement
    (block
      (var_decl
        (linkage)
        (ident)
        (expression
          (string))))))

================================================================================
Throw
================================================================================

throw "123";

--------------------------------------------------------------------------------

(module
  (statement
    (throw_
      (expression
        (string)))))
